todoapp/app/views/projects/index.html.erb

SELECT "todos".* FROM "todos" WHERE "todos"."project_id" = $1  [["project_id", 1]]
---
						<ul>
							<% project.todos.each do |todo| %>

SELECT "projects".* FROM "projects"
---
					<%= f.text_field :text, placeholder: "Название задачи..." %><br />
					<%= f.select "project", options_from_collection_for_select(@projects, "id", "title") %><br/>