todoapp/app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects"
SELECT "todos".* FROM "todos" WHERE "todos"."project_id" = $1  [["project_id", 1]]
---
  def index
  	@projects = Project.all
  	@todos = Todo.all

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
  def show
    @projects = Project.find(params[:id])

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
UPDATE "todos" SET "isCompleted" = $1, "updated_at" = $2 WHERE "todos"."id" = $3  [["isCompleted", "t"], ["updated_at", "2017-09-09 23:52:09.871887"], ["id", 5]]
---
  def edit
    @todo = Todo.find(params[:id])
    if @todo.isCompleted == "t"
      @todo.isCompleted = true
    end

    if  @todo.update_attributes(todo_params)

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
INSERT INTO "todos" ("text", "project_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["text", "Помыть посуду"], ["project_id", 1], ["created_at", "2017-09-08 16:01:44.504856"], ["updated_at", "2017-09-08 16:01:44.504856"]]
---
  def create
	  @project_id = params.require(:todo).permit(:project).values[0]
    @project = Project.find(@project_id)
    @todo = @project.todos.new(todo_params)
    if @todo.save